#language: ru
Функционал: поиск и добавление товаров на Озоне

  @phones
  Сценарий: поиск и добавление iPhone

    Когда выбран пункт главного меню "Электроника"
    И выбрана категория "Телефоны"
    И выбран производитель "Apple"
    И заполнена цена ОТ "50000"
    И добавлен товар в Корзину
    И открыта Корзина
    Тогда проверить товары в Корзине
    И проверить итоговую сумму в Корзине
    Когда очищена Корзина
    Тогда проверить что корзина пуста

  @cameras
  Сценарий: поиск и добавление Nikon/Canon

    Когда выбран пункт главного меню "Электроника"
    И выбрана категория "Фотоаппараты"
    И выбрана подкатегория "Зеркальные фотоаппараты"
    И выбран производитель "Nikon"
    И выбран производитель "Canon"
    И заполнена цена ОТ "80000"
    И добавлен товар в Корзину
    И открыта Корзина
    Тогда проверить товары в Корзине
    Когда очищена Корзина
    Тогда проверить что корзина пуста
