#language: ru
Функционал: поиск и добавление товаров на Озоне

  @test1 @all
  Сценарий: поиск и добавление iPhone

    Когда выбран пункт главного меню "Электроника"
    И выбрана категория "Телефоны"
    И выбран производитель "Apple"
    И заполнена цена ОТ "50000" ДО "70000"
    И добавлены товары в Корзину - первые 4 шт.
    И открыта Корзина
    Тогда проверить товары в Корзине
    И проверить итоговую сумму в Корзине
    Когда очищена Корзина
    Тогда проверить что корзина пуста

  @test2 @all
  Сценарий: поиск и добавление Nikon/Canon

    Когда выбран пункт главного меню "Электроника"
    И выбрана категория "Фотокамеры"
    И выбрана подкатегория "Зеркальные фотокамеры"
    И выбран производитель "Nikon"
    И выбран производитель "Canon"
    И заполнена цена ОТ "80000"
    И добавлены товары в Корзину - первые 3 шт.
    И открыта Корзина
    Тогда проверить товары в Корзине
    Когда очищена Корзина
    Тогда проверить что корзина пуста
